In [4]:
import mysql.connector
from pymysql import connect
from mysql.connector import Error 
import pandas as pd

In [20]:
data1=connect(host='localhost',user='root',passwd='Manju_004')
curs =data1.cursor()
query='show databases'
cur.execute(query)
datas1=cur.fetchall()
for data in datas1:
    print(data)

('abcltd',)
('amitdb',)
('information_schema',)
('labours',)
('mmltd',)
('mysql',)
('performance_schema',)
('sys',)

In [22]:
data2=connect(host='localhost',user='root',passwd='Manju_004',database='mmltd')
curs=data2.cursor()
query='show tables'
curs.execute(query)
datas2=curs.fetchall()
for x in datas2:
    print(x)

('employee_info',)
('mmltd_data',)

In [25]:
query='select * from mmltd_data'
curs.execute(query)

3

In [26]:
import pandas as pd 
mmltd_data=pd.read_sql(query,data2)

C:\Users\Manjula\AppData\Local\Temp\ipykernel_9064\124185261.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  mmltd_data=pd.read_sql(query,data2)

In [27]:
mmltd_data

,Id_no,Name,Mobile_no,Email_Id,Age,Designation,salary,pf_amt
0,101,Leena,9983456234,meenamanogar@gmail.com,34,dataanalytics,150000,2000
1,102,Meena,9978675645,Leenasundar@gmail.com,24,dataengineer,170000,3000
2,103,Teena,7401346657,teenalusee@gmail.com,36,datascientist,180000,None